2025-04-15 21:29:12,664 [INFO] 程序启动
2025-04-15 21:29:12,664 [INFO] 用户未登录，启动登录界面
2025-04-15 21:29:25,462 [INFO] 用户 YH 尝试登录
2025-04-15 21:29:38,112 [INFO] 用户 YH 尝试登录
2025-04-15 21:29:44,638 [INFO] 用户 YH 尝试登录
2025-04-15 21:29:50,449 [INFO] 用户 YH 尝试登录
2025-04-15 21:30:14,619 [INFO] 用户 YH 尝试登录
2025-04-15 21:30:21,618 [INFO] 用户 YH 尝试登录
2025-04-15 21:30:25,383 [INFO] 用户 YH 尝试登录
2025-04-15 21:30:27,564 [INFO] 用户 YH 尝试登录
2025-04-15 21:30:29,538 [INFO] 用户 YH 尝试登录
2025-04-15 21:30:35,136 [WARNING] 用户取消登录，程序退出
2025-04-15 21:31:15,980 [INFO] 程序启动
2025-04-15 21:31:15,981 [INFO] 用户未登录，启动登录界面
2025-04-15 21:34:11,090 [INFO] 用户 Yh 尝试登录
2025-04-15 21:34:11,191 [INFO] 图像编辑器启动 - 用户: Yh(ID:3)
2025-04-15 21:34:18,133 [INFO] 用户 Yh 打开图片
2025-04-15 21:34:23,921 [INFO] 用户 Yh 进行打开图片处理: 文件路径: E:/Dlearning/test.jpg
2025-04-15 21:34:32,304 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:34:32,308 [INFO] 用户 Yh 进行浮雕效果处理: 
2025-04-15 21:34:34,539 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:34:34,543 [INFO] 用户 Yh 进行素描效果处理: 
2025-04-15 21:34:38,624 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:34:38,627 [INFO] 用户 Yh 进行风格化处理: 
2025-04-15 21:34:42,449 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:34:42,453 [INFO] 用户 Yh 进行黑白效果处理: 
2025-04-15 21:34:45,489 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:34:45,492 [INFO] 用户 Yh 进行反相效果处理: 
2025-04-15 21:34:47,806 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:34:47,809 [INFO] 用户 Yh 进行反相效果处理: 
2025-04-15 21:34:48,062 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:34:48,066 [INFO] 用户 Yh 进行反相效果处理: 
2025-04-15 21:34:48,498 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:34:48,502 [INFO] 用户 Yh 进行反相效果处理: 
2025-04-15 21:34:48,827 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:34:48,831 [INFO] 用户 Yh 进行反相效果处理: 
2025-04-15 21:34:49,288 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:34:49,291 [INFO] 用户 Yh 进行反相效果处理: 
2025-04-15 21:34:49,850 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:34:49,854 [INFO] 用户 Yh 进行反相效果处理: 
2025-04-15 21:34:50,510 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:34:50,515 [INFO] 用户 Yh 进行反相效果处理: 
2025-04-15 21:34:51,251 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:34:51,256 [INFO] 用户 Yh 进行黑白效果处理: 
2025-04-15 21:34:51,678 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:34:51,682 [INFO] 用户 Yh 进行黑白效果处理: 
2025-04-15 21:34:51,908 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:34:51,913 [INFO] 用户 Yh 进行黑白效果处理: 
2025-04-15 21:34:52,333 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:34:52,337 [INFO] 用户 Yh 进行黑白效果处理: 
2025-04-15 21:34:56,316 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:34:56,319 [INFO] 用户 Yh 进行二值化处理: 阈值:127
2025-04-15 21:34:56,919 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:34:56,921 [INFO] 用户 Yh 进行二值化处理: 阈值:127
2025-04-15 21:34:57,236 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:34:57,239 [INFO] 用户 Yh 进行二值化处理: 阈值:127
2025-04-15 21:35:01,713 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:35:05,579 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:35:06,566 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:35:07,193 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:35:07,400 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:35:09,684 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:35:10,073 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:35:10,419 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:35:10,704 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:35:10,919 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:35:32,309 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:35:43,093 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:35:46,371 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:35:52,072 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:35:52,076 [INFO] 用户 Yh 进行风格化处理: 
2025-04-15 21:35:57,312 [INFO] 用户 Yh 进行应用更改处理: 
2025-04-15 21:35:57,316 [INFO] 用户 Yh 进行二值化处理: 阈值:127
2025-04-15 21:36:35,141 [INFO] 图像编辑器启动 - 用户: YH(ID:1)
2025-04-15 21:36:47,800 [INFO] 用户 YH 进行应用更改处理: 
2025-04-15 21:36:47,804 [INFO] 用户 YH 进行旋转图片处理: 
2025-04-15 21:36:50,728 [INFO] 用户 YH 进行应用更改处理: 
2025-04-15 21:36:50,732 [INFO] 用户 YH 进行旋转图片处理: 
2025-04-15 21:36:51,367 [INFO] 用户 YH 进行应用更改处理: 
2025-04-15 21:36:51,371 [INFO] 用户 YH 进行旋转图片处理: 
2025-04-15 21:36:51,814 [INFO] 用户 YH 进行应用更改处理: 
2025-04-15 21:36:51,817 [INFO] 用户 YH 进行旋转图片处理: 
2025-04-15 21:36:53,787 [INFO] 用户 YH 进行应用更改处理: 
2025-04-15 21:36:53,790 [INFO] 用户 YH 进行翻转图片处理: 
2025-04-15 21:36:54,908 [INFO] 用户 YH 进行应用更改处理: 
2025-04-15 21:36:54,912 [INFO] 用户 YH 进行翻转图片处理: 
2025-04-15 21:37:31,891 [WARNING] 用户取消登录，程序退出
2025-04-15 21:37:35,713 [INFO] 程序启动
2025-04-15 21:37:35,714 [INFO] 用户未登录，启动登录界面
2025-04-15 21:37:45,034 [INFO] 用户 YH 尝试登录
2025-04-15 21:37:45,091 [INFO] 图像编辑器启动 - 用户: YH(ID:1)
2025-04-15 21:37:46,605 [INFO] 用户 YH 打开图片
2025-04-15 21:37:48,605 [INFO] 用户 YH 进行打开图片处理: 文件路径: E:/Dlearning/test.jpg
2025-04-15 21:37:57,866 [INFO] 用户 YH 进行应用更改处理: 
